#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-uGAsrDJFb4MogjhU

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
random_password.db_password: Refreshing state... [id=none]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=tf-apply-scheduler]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210817012201712900000001]
aws_api_gateway_resource.actions: Refreshing state... [id=i57f4h]
aws_api_gateway_resource.app: Refreshing state... [id=l8dcc6]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_api_gateway_resource.actions_proxy: Refreshing state... [id=cmapde]
aws_api_gateway_method.actions_proxy: Refreshing state... [id=agm-gcp9dahm4c-cmapde-ANY]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
aws_lambda_function.scheduler: Refreshing state... [id=lambda-scheduler]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_lambda_permission.scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.scheduler: Refreshing state... [id=tf-apply-scheduler-scheduler]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-gcp9dahm4c-cmapde-ANY]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-gcp9dahm4c-oly2td-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=x2sfag]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      + function_name = "lambda-db"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-03-13T07:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "l2AsyRCaMG3SkeyOn9BmPzY6+JC0TOwYf0EcX9q1ZoY=" -> "k82dzaEx18qdzOLfM50GdclH58h4HdLP3bqucHDI56Y="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-03-13T07:21:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "z+6Rtm+Ait8Emg5l0Fd651/PfBrILdCepMznaHo9ky4=" -> "MpoUihYprD1QRXCKzeKO2+GFGO027I6K8xArjuzVFOk="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2022-03-13T07:20:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "VyH/zCr/MsL+sVEMjW2WNJcvTX1IyVxU/R2l4yQllOE=" -> "cWVzEgfQwJRz640ZjdubQi5dzfDxFVGmHa3f9lHC6NQ="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.scheduler will be updated in-place
  ~ resource "aws_lambda_function" "scheduler" {
        id                             = "lambda-scheduler"
      ~ last_modified                  = "2022-03-13T07:21:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "YUWKUiRlPKw3cgk9tnu3mKKvZd4/5UYs6KJOj2mT/OA=" -> "PlN1hsMF0+X/Xn3e+L6XoJ9OG6FMQJDjNaxV5dtZqJ0="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-03-11T21:18:26.203Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 2 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*